This is used to post warning. The distance between the connected ends of the bars exceeds 10 bar diameters.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
 Syntax
  C#
public static FailureDefinitionId DistanceBetweenBarsWarning { get; }
  Visual Basic
Public Shared ReadOnly Property DistanceBetweenBarsWarning As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ DistanceBetweenBarsWarning {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures RebarCouplerFailures Class
  Autodesk.Revit.DB Namespace